[
  {
    "id": "1",
    "title": "Why the Smartest Students are Taking Matters Into Their Own Hands",
    "content": "<h2>The Great School Heist: My Education, My Rules</h2><p>Why am I taking matters into my own hands? And why are these 'I’m nothing like ya’ll' lame-ahh smart students doing the same? Because the system that’s supposed to teach me can’t even teach itself. Every day in class, I see **talent wasted**, **creativity punished**, and **intelligence buried** under modules, rubrics, and 'requirements' that are as useful in the real world as a wooden spoon in a gunfight. We're tired of waiting for a system that still thinks knowing how to draw a parabola on a chalkboard is more important than understanding how to file taxes, land a job, or simply survive the chaos outside the school gates.</p><p>We take matters into our own hands because the system is designed to produce workers, not thinkers. It measures how well we memorize, not how well we think. It teaches us to obey, not to innovate—because, of course, they need a new generation of worker ants. They prepare us for tests, not for life itself, and they kill our curiosity, then wonder why we don’t care anymore.</p><h3>The Illusion of Learning</h3><p>The traditional classroom setting feels like an elaborate theater of the absurd. We sit, we listen, we pretend to absorb information that will be promptly forgotten after the final exam. The **real lessons**—the ones that teach you resilience, financial independence, and genuine problem-solving—are nowhere to be found. We're taught to follow a predefined path, a blueprint for mediocrity, while the world outside is screaming for innovators, not memorizers.</p><p>This is why we've formed our own underground, a rebellion not against knowledge, but against its flawed delivery. We're a generation of self-starters and autodidacts, leveraging the internet to fill the gaping voids left by our education. We learn to code by building real projects, we understand finance by managing our own side hustles, and we develop critical thinking by debating ideas, not just regurgitating facts. </p><h3>The System's Fatal Flaw</h3><p>The system's fatal flaw isn't a lack of resources, but a lack of relevance. It's a relic of a bygone industrial era, designed to churn out factory workers for a world that no longer exists. The most brilliant minds are those who recognize this and choose to forge their own paths, to create their own curriculum, and to define success on their own terms. We're not dropping out; we're just checking out of a system that has already left us behind.</p><p>Maybe we’re lame for not playing along. Maybe we look arrogant for saying, 'I'm not like the rest.' But maybe we're just the only ones awake. We are **TUFF GNG?!** We self-study, we build and pursue many things outside of school, and we chase the knowledge the system won't give us. Because if we don't, who will? The smartest students aren’t trying to be above anyone; we’re just trying to be **free**. Free from outdated lessons. Free from suffocating rules. Free to learn what actually matters.</p><p>And if that makes us 'different'? Good. That’s the point. IN CONCLUSION (SORRY FOR THE SHORT BLOG, but I gotta get back to my own projects): These level 1 crook-ahh schools are way too low-level for our aura (we are level 500 mafias) and we have to go do something meaningful in our lives rather than just get spawncamped with work and boring lessons.</p>",
    "excerpt": "A raw, unfiltered look into why the most intelligent students are abandoning traditional education to pursue real-world knowledge on their own terms.",
    "authorId": "author6",
    "category": "Opinion",
    "tags": [
      "Education",
      "Rant"
    ],
    "likes": [
      "author7",
      "author8",
      "author9",
      "author10"
    ],
    "views": 5321,
    "comments": [
      {
        "id": "comment_1724640001000",
        "authorId": "author1",
        "content": "This is so true! I feel the exact same way about my classes. The content is so outdated and disconnected from what's actually useful.",
        "createdAt": "2024-07-25T16:00:00.000Z"
      },
      {
        "id": "comment_1724640002000",
        "authorId": "author5",
        "content": "I get the frustration, but it's important to have a foundational education. Not everyone can just teach themselves everything.",
        "createdAt": "2024-07-25T16:05:00.000Z"
      },
      {
        "id": "comment_1724640003000",
        "authorId": "anonymous",
        "content": "Couldn't have said it better myself. The whole system needs a major overhaul.",
        "createdAt": "2024-07-25T16:10:00.000Z"
      }
    ],
    "createdAt": "2024-07-20T10:00:00.000Z",
    "updatedAt": "2024-07-20T10:00:00.000Z",
    "isSpotlight": true,
    "readTime": 5,
    "thumbnailUrl": "./thumbnails/blog-1-cover.jpg"
  },
  {
    "id": "2",
    "title": "100 Brutal Reasons to Hate the Philippine Education System",
    "content": "<h2>Why We Hate the Game, Not the Players</h2><p>Ahh crap, here we go again. The Philippine education system—just can’t stop loving it, amirite? I've put myself through this negativity enough, I'm kinda tired, but whatever. Disclaimer: We are **NOT** hating people here; we’re **HATING THE GAME, NOT THE PLAYERS**. This is just a simple ramble about why school systems, not just here but all over the world, need to improve their practices, their budgeting, and why they need to actually care more. I’m talking about the higher-ups here… corrupt-ahh diddybluds. Enough yapping, back to ranting.</p><h3>🎓 Curriculum & Content</h3><ul><li>Overloaded with subjects, underloaded with relevance.</li><li>Too much memorization, too little critical thinking.</li><li>Outdated material from decades ago with minimal emphasis on modern skills.</li><li>Curriculum lacks alignment between K–12 and actual college or job needs.</li><li>Pointless subjects we’ll never use are forced on us.</li><li>Arts and humanities are treated as 'extra' or 'useless.'</li><li>Values Education is taught in class but ignored in practice.</li><li>K–12 promised 'job readiness' but failed to deliver.</li></ul><h3>📚 Teaching & Methods</h3><ul><li>Teachers are forced to rush lessons just to finish modules.</li><li>Rote learning dominates creativity.</li><li>Obsession with standardized testing kills curiosity.</li><li>Group activities often mean the 'smart kid does all the work.'</li><li>Teachers lecture endlessly instead of engaging.</li><li>Zero room for questioning authority.</li><li>Some teachers shame students in front of classmates.</li><li>Homework is an overload with no real value.</li><li>Our second parents are underpaid, overworked, and demotivated, and they deserve better treatment.</li></ul><h3>🏫 Facilities & Resources</h3><ul><li>Overcrowded classrooms with 60 students in one room.</li><li>Broken electric fans are the only 'aircon substitute.'</li><li>Schools lack proper libraries and internet access.</li><li>Science labs exist only on paper.</li><li>Textbooks are full of errors.</li><li>Not even enough chairs for all the students.</li><li>Ceilings leak when it rains, and public school toilets are nightmare fuel.</li><li>It’s 2025, and some schools still use chalkboards, which is just heartbreaking.</li></ul><h3>👨‍💼 Administration & Bureaucracy</h3><ul><li>DepEd’s endless paperwork burdens teachers more than students.</li><li>Too many useless meetings.</li><li>School budgets are plagued by corruption, and funds for facilities often 'disappear.'</li><li>Politicians use schools for photo ops.</li><li>Decisions are overly centralized, ignoring local needs.</li><li>Curriculum revisions happen every few years with no real improvements.</li><li>There are 'band-aid solutions' instead of systemic reform.</li><li>Nepotism and 'palakasan system' are rampant in hiring and promotions.</li></ul><h3>🧠 Student Experience</h3><ul><li>School often kills creativity.</li><li>Students are judged by grades, not skills.</li><li>'Honor students' are worshipped while average students are ignored.</li><li>Bullying is left unchecked.</li><li>Uniforms cost too much.</li><li>Strict haircuts matter more than actual learning.</li><li>Obsession with attendance, even when sick.</li><li>Late policies are harsher than actual crimes.</li><li>Students are pressured to join useless school events.</li><li>Toxic competitiveness runs wild.</li></ul><h3>💸 Money & Inequality</h3><ul><li>The 'free education' still costs a lot, with projects, uniforms, and contributions.</li><li>PTA fees are disguised as 'voluntary' but are actually forced.</li><li>Public schools are underfunded, and private schools are overpriced.</li><li>Tuition hikes happen yearly with no real improvements.</li><li>Poor students are left behind.</li><li>Scholarships are rare.</li><li>Textbooks and modules are often paid for out-of-pocket.</li><li>Teachers spend their own money on class materials.</li><li>Students are even pressured to bring cleaning supplies as a bargain for grades.</li></ul><h3>🌏 Real-World Relevance</h3><ul><li>School doesn’t prepare you for **TAXES**.</li><li>No practical financial literacy or real entrepreneurship training.</li><li>Career guidance is just 'pick a strand.'</li><li>We graduate knowing Shakespeare, not how to write a CV.</li><li>Severe lack of training in modern job skills like AI, IT, and global communications.</li><li>Focus is on theory, with zero on practice.</li><li>It’s all college prep, no life prep.</li><li>Students are clueless about mental health and civic responsibility.</li></ul><h3>⚖️ Cultural Issues</h3><ul><li>Colonial mentality is embedded in history lessons.</li><li>We glorify rote nationalism instead of critical patriotism.</li><li>We practice hero worship instead of nuanced history.</li><li>Religious bias is rampant, and sex education is avoided or censored.</li><li>LGBTQ+ issues are ignored or shamed.</li><li>Toxic mindset of 'respect your elders even if they’re wrong' applies to higher-ups.</li><li>We're a culture of silence, where students are discouraged from speaking up.</li><li>Obedience is valued over innovation, and success is measured by grades, not actual competence.</li></ul><h3>🧑‍🏫 Teachers & Staff</h3><ul><li>Some teachers treat school like a dictatorship and play favorites.</li><li>Students with connections get away with cheating.</li><li>Some teachers don’t even know their own subject and rely on slides from the internet.</li><li>Lack of professional development and no accountability for incompetent teachers.</li><li>Some teachers can be abusive, and burnout makes them take frustrations out on students.</li><li>Many teachers treat it as just a fallback job.</li></ul><h3>🔮 Systemic Problems</h3><ul><li>The education system is designed to produce workers, not thinkers.</li><li>It's too exam-oriented, and pass/fail metrics don’t reflect real skills.</li><li>Dropout rates are still high.</li><li>No strong link between industry and school.</li><li>Teachers are forced to follow unrealistic quotas.</li><li>The learning gap between rich and poor keeps widening.</li><li>Reforms are always announced but never executed.</li><li>Education is used as political propaganda.</li><li>Students come out exhausted, not empowered.</li></ul><p>And then the government wonders, 'Oh boy, why do people think school sucks?' But of course, ignorance is bliss, which is why you see these lying-out-of-their-tongue politicians always smiling with their empty promises. Must be fun having all that money you cut from budgets that were supposed to go to more important things, right? Nonetheless, this blog won't have any 'in conclusion!' because the entire blog IS the conclusion. Peace be with you, but take care too.</p>",
    "excerpt": "A comprehensive and brutal list of 100 reasons why the Philippine education system is failing its students, from curriculum flaws to bureaucratic corruption.",
    "authorId": "author6",
    "category": "Opinion",
    "tags": [
      "Education",
      "Rant"
    ],
    "likes": [
      "author11",
      "author12",
      "author1"
    ],
    "views": 8765,
    "comments": [
      {
        "id": "comment_1724640004000",
        "authorId": "author3",
        "content": "This is a masterpiece. Every point is painfully accurate. It's sad how much talent is wasted.",
        "createdAt": "2024-07-25T16:15:00.000Z"
      },
      {
        "id": "comment_1724640005000",
        "authorId": "author4",
        "content": "What about the good teachers? My science teacher is a lifesaver. You can't just generalize everyone.",
        "createdAt": "2024-07-25T16:20:00.000Z"
      },
      {
        "id": "comment_1724640006000",
        "authorId": "author5",
        "content": "The part about financial literacy hit hard. I'm graduating soon and have no idea how to manage my money. All that math, for nothing.",
        "createdAt": "2024-07-25T16:25:00.000Z",
        "isAnonymous": true
      }
    ],
    "createdAt": "2024-07-21T14:30:00.000Z",
    "updatedAt": "2024-07-21T14:30:00.000Z",
    "isSpotlight": true,
    "readTime": 15,
    "thumbnailUrl": "./thumbnails/blog-2-cover.jpg"
  },
  {
    "id": "3",
    "title": "Too Many Lame Gangs Infesting Our Educational Institutions",
    "content": "<h2>Why School Gangs Are Lame</h2><p>Yuhhhh, lil liam at it again, on this blog, as can be seen on the title, I'll be talking about these TUFF gangs! Now, do note that some people that join gangs (mostly youth) may have undergone through a bad situation in their lives, this does NOT mean that you can just judge them solely based off of shallow observations and or prejudiced opinions, nor can you go join gangs just because you've gone through some problems in life. I do NOT endorse the joining of gangs, but this doesn't mean you have to harass the people in gangs. Be respectful and diplomatic, okay? I am TALKING about the problem, that being these GANGS forming in these schools. Alright, now that I got that off my shoulder.</p><p>Now WHY are these lame ahh gangs infesting our school? Seriously, I can barely stand them, them and their geng geng jargons and vocabulary, I can barely stand how they act so disrespectfully and how they try to act 'different' and 'exclusive' man, boy GET OUT! You are NOT unique just because you joined a gang nor because you act like a GAAANSTAAAHHH lil bro. I'm talking about those people who join gangs because they think it's cool to be in a damn gang, I'm mentioning those fake, posey, act-cool gangs that just do stuff and act like they're 'tough' for the fun of it. If you have an identity crisis and don't know what you want to be, just DON'T be a gang please, it's so damn lame, GANGS? In the BIG 25? IN THIS DAY AND AGE? bro go get a part time job or something, ANYTHING but gangs and criminal activities in your post-class hours bro.</p><p>These people are usually the type to get these SPECTACULAR haircuts as a 'branding' for whatever gang they are from, which they copied from some real gangs back in the ages. 'Ohh why are you being so mean towards those people liam? They're just cosplaying as gangs!!!' okay mr. goody two shoes, they're also the type to go drink, go smoke, go do allat cuz they think it's SO awesome, amazing actors amirite? Really playing out their roles on being a full time IDIOT. 'We sacrificed our lungs for the safety of our minds' man SHUT UP. SHUT. UP. YOU ARE NOT TUFF NOR ARE YOU 'OPPRESSED' OR 'TRYING TO GET OUT OF THE HOOD' WHAT HOOD BRO, WHAT BLOCK ARE YOU IN? YOU MUST BE LIVING IN ANOTHER DIMENSION cause BRO you do NOT need to be no GANG just to get out of some simple inconvenience that you probably made out to be way larger than it's supposed to be, and then act all hard workey for it, just cause your mom said no mcdonalds doesn't mean you have to go deal drugs and commit crimes.</p><p>Now I'm talking about those pseudo real gangs, ones who commit such petty larcenies, and for WHAT? They aren't even using that money for anything worthwhile, all vices, vices here vices there, lust here lust there. These parasites infesting our schools PISS ME OFF a little... I also forgot to mention, these people are heavily bad influences on their more 'normal' peers, they do such dirty tactics like peer pressure to get those with lower esteem to do stuff for them, now they got a new playtoy to mess with, or they could harass somebody and lower their self value and many other problems, this is not just bullying anymore, this is manipulative, malicious, ill-intended crimes against your fellow man. If you do this sort of stuff, and the stuff I listed earlier (even if they're less heavy in terms of how heavy the sins are), you got what's coming for you, you worked for what you will have.</p><p>Oh, and you may also be wondering, 'Where are the real gangs?' Bro. Do I need to talk about them? Everything I coulda said here coulda applied to them, and besides, I'm kinda tired of just typing this all out so I'll finish this in a quick few sentences: These people probably went through bad situations, poor them, right? But that doesn't mean you have to process it through grudges, anger planted in your mind, if you do, you should search for God, now that's a topic I won't talk about, if anyone expected me to, just, go. Look for God, from the bottom of your heart, search for Him, only He'll know if you're truly looking for Him or not. Back on track, these people are victims of their circumstances, pray for them, and don't harass nor bully them. It is within God's teachings that you love everyone, even your enemies, simple stuff. Be different, because if you bully or harass these people or think bad or lowly of them, or have ill intent against them? You're just the same as them, you just stoop to their level, and always remember, they're human too.</p><p>IN CONCLUSION: SCHOOLS NEED TO DO SOMETHING ABOUT THIS PLEASE GO HELP THEM</p>",
    "excerpt": "A brutal takedown of the 'lame-ahh gangs' infesting schools, distinguishing between those genuinely suffering and those who join for the 'aesthetic' of being tough.",
    "authorId": "author6",
    "category": "Opinion",
    "tags": ["Rant", "Social Issues", "School"],
    "likes": ["author14", "author15", "author16", "author17", "author18"],
    "views": 4123,
    "comments": [
      {
        "id": "comment_1724640007000",
        "authorId": "author6",
        "content": "Preach! It's so cringey to see them try to act all hard.",
        "createdAt": "2024-07-26T10:00:00.000Z"
      },
      {
        "id": "comment_1724640008000",
        "authorId": "author7",
        "content": "This is a great point. You have to be diplomatic but firm with them.",
        "createdAt": "2024-07-26T10:05:00.000Z",
        "isAnonymous": true
      }
    ],
    "createdAt": "2024-07-22T12:00:00.000Z",
    "updatedAt": "2024-07-22T12:00:00.000Z",
    "isSpotlight": true,
    "readTime": 10,
    "thumbnailUrl": "./thumbnails/blog-3-cover.jpg"
  },
  {
    "id": "4",
    "title": "The Obliviousness of Schools in the 21st Century",
    "content": "<h2>School's Fatal Blind Spots</h2><p>Heyyy, it's me, Liam. I'm here to rant again, specifically about what the title says. Now: how are schools being oblivious? Surely, in the 21st century, it should be the opposite, right? Inclusive, patient, supportive, neat and organized. Not really. Sure, they've improved in some areas - we've got better tech, updated policies, and 'awareness campaigns.' But overall? Schools are still blind to the most IMPORTANT aspects of what it means to educate human beings, not just train test-takers.</p><p>Why is school so... hard to deal with? Why does it feel like the system is deliberately pushing students to their breaking point? Can't we get some leeway and lenience here? Can't we get some actual investigative action into what students are struggling with? Where are the 'hey, are you okay?' checks from time to time? Youths need it. Especially youths. We're at an important stage in life, and most of us are vulnerable confused, stressed, trying to figure out who we are while the SYSTEM tells us to hurry up. Schools should know this. They should care. But instead, what do we get? Another pile of assignments. Another standardized test. Another lecture about responsibility, without the slightest attempt to understand the reality we're dealing with.</p><h3>Obliviousness looks like this:</h3><ul><li>Teachers telling us to 'manage our time better' while drowning us in deadlines.</li><li>Schools bragging about 'mental health programs' that are basically one seminar a year.</li><li>Administrators preaching 'holistic education' while measuring worth only by grades.</li><li>Punishing latecomers without asking why they're late.</li><li>Talking about 'safe spaces' while ignoring bullying right under their noses.</li></ul><p>It's 2025. In this day and age, we know more than ever about psychology, mental health, and the importance of empathy in education. Yet schools act like all they need to do is maintain order, enforce discipline, and crank out 'graduates' like factory products. You'd think schools would listen by now. You'd think they'd ask, 'Hey, what do students actually need in this century?' But no bruh. They're too busy protecting tradition, too obsessed with appearances, too scared to face the truth that the system they're clinging to is crumbling right before their very eyes (shakesperian writing right now).</p><p>And IN CONCLUSION: Schools are like old heads with their old class and their old beliefs, rules and so on and so forth, here come the new kids with the different, new approaches that the schools need to take in order for mismatch to not happen, apparently no!! Hecks nah bro they just be ignoring it, they br thinking its a dictatorship out here, PEACE!</p>",
    "excerpt": "A deep dive into how schools are out of touch with the needs of 21st-century students, from mental health to curriculum relevance, and why their 'obligated' mindset needs to change.",
    "authorId": "author6",
    "category": "Opinion",
    "tags": ["Education", "Mental Health","Rant", "Systemic Issues"],
    "likes": ["author19", "author20", "author21", "author22"],
    "views": 6543,
    "comments": [
      {
        "id": "comment_1724640009000",
        "authorId": "author8",
        "content": "The part about 'manage your time better' hit me hard. It feels like they just don't care about the workload.",
        "createdAt": "2024-07-26T10:10:00.000Z"
      },
      {
        "id": "comment_1724640010000",
        "authorId": "author9",
        "content": "This blog is a wake-up call for every school administrator out there.",
        "createdAt": "2024-07-26T10:15:00.000Z",
        "isAnonymous": true
      }
    ],
    "createdAt": "2024-07-23T08:00:00.000Z",
    "updatedAt": "2024-07-23T08:00:00.000Z",
    "isSpotlight": true,
    "readTime": 8,
    "thumbnailUrl": "./thumbnails/blog-4-cover.jpg"
  },
  {
    "id": "5",
    "title": "Why School is the Biggest Setback to Your Success",
    "content": "<h2>School's a Setback, Not a Step-Up</h2><p>Bruh, do I really have to talk about this..? the groupings' task distribution states that I have to, WHATEVER. So, why is school the setback to your success? no one may ever ask. well, GOOD question, man, good question, I wonder why? Is it because schools always seem to give out work and treat them akin to how a pacifier is to a baby (to keep us busy and occupied)? Is it because schools never seem to actually teach us about actual vital things we'll need and skills we have to harness in order to survive out there in the real world? Ho boy does me wonder why the heck schools, which are supposed to aid us in having a future at all, somehow IMPEED us from having such as so? well well well, let me enlighten you dear reader, on the absolute dookie that the school system is and how garbage it is on what it's supposed to do for us.</p><p>First of all, schools don't teach us to pay taxes, and they NEVER demonstrate to us how to obtain W rizz to catch some $10/10$ huzz, jokes aside though... Let's take our country's school system, better yet, the big Philippine Christian University, let's talk about how BOOOORIIIINGGG the lessons are, sure I appreciate the teachers here that actually care for us, I know they're trying their best to teach us, hoping for the best of our futures, really, I love them for it, but MAN, does the SCHOOL CURRICULUM and the SYSTEM suck ahh, bro I cannot for the life of me actually focus in on the lessons, the teacher's spit and all their yapping is all going to waste on me, as well as probably many other students, cuz let's be real here, most of us don't actually listen on the lessons, heck, the only times we'll understand the lessons are when we're reviewing them for the exam! The GOVERNMENT, as well as the governments outside of our countries really need to work on improving how their schools operate There's lacking in many aspects of the school systems that I could go on about for ages, but here are some of them for reproof: mismatch in learning styles for example, this could also include the lack of engagement in the lessons and activities given within the classes, the last time I had a fun engaging experience was when my Personal Development teacher got us to do a pretty fun game in order to aid us for the coming exams by basically having a mock exam of what we've reviewed so far through the medium of a 'family feud' type game, fun stuff fun stuff, be more like that! I like that, we like that, everyone loves it, no stressful work that you do at home, no boring yapping sessions, just fun engaging activities that also enlighten us on the essentials of the lessons. And to be honest, the K-12 stuff doesn't really even help with the future thing, and in my personal opinion, I don't think it works. Why, you ask? I haven't decided for my future that much yet, even if I think long and hard about what to be in the future, it just... doesn't come to light, because honestly I just go where God wants me to go, and these Senior High stuff, career planning, contributes NOTHING to aid me in that, so there's that. I'm more concerned about what to do when I turn 18 and what I should pursue, or what job I have to do, I just want to chill and play games, but let's be real, the system here is basically study study study, work hard on school for a job where you also have to work hard daily. From study study study, to work work work, zero difference, just different mediums, time consuming, the study hard in school only to still work hard in a 9/5 job shtick, pretty boring, gives you no future, it seems so bleak... But I want out, most want out, but they're still stuck staying stagnant in those lives they lead... That's why I'd probably just work a work-from-home job that'd get me decent money and I even get to play games while I work (no man will know.) Anyways, a pretty cluttered and messy rantblog about why schools set our futures back.</p><p>IN CONCLUSION: Schools never really seem to teach us anything vital for surviving in the real world, and it would seem that even if we study and work hard and smart for that degree, the future opportunities we have would be bleak, so either be something new, or be like the rest of the worker ants doing their everyday 9/5 jobs.</p><p>Lillahm here, peace out</p>",
    "excerpt": "A passionate rant on how schools fail to teach vital real-world skills, creating a bleak future where students are just trained to be 'worker ants' in a 9-5 job.",
    "authorId": "author6",
    "category": "Opinion",
    "tags": ["Education", "Work Life","Rant"],
    "likes": ["author23", "author24", "author25", "author26", "author27"],
    "views": 7890,
    "comments": [
      {
        "id": "comment_1724640011000",
        "authorId": "author10",
        "content": "You nailed it. The whole 'study hard, get a job, struggle' cycle is so depressing.",
        "createdAt": "2024-07-27T10:00:00.000Z"
      },
      {
        "id": "comment_1724640012000",
        "authorId": "author11",
        "content": "This makes me want to drop out right now. Seriously.",
        "createdAt": "2024-07-27T10:05:00.000Z",
        "isAnonymous": true
      }
    ],
    "createdAt": "2024-07-24T14:30:00.000Z",
    "updatedAt": "2024-07-24T14:30:00.000Z",
    "isSpotlight": true,
    "readTime": 12,
    "thumbnailUrl": "./thumbnails/blog-5-cover.jpg"
  },
  {
    "id": "6",
    "title": "The Ineffective and Boring Experience of Online Class",
    "content": "<h2>Online Classes are a Joke</h2><p>Man, online classes are so lame. It can never really catch the same type of environment in an actual classroom setting. Let's be honest here, almost everyone of us never, or at least has never listened to at least 1 lesson in our online classes, and to that I say, I can't really blame you. There are numerous problems with online classes, and there are a number of reasons why so. Today, I'll be delving into that sorta topic.</p><p>The implementation of Online classes was haphazard, it originated as the new normal a few years back when the COVID pandemic was still prevalent, it helped get students to still study while staying protected from the big scary virus that originated from China. Even then... it's still so easy to get distracted, lose focus on the lessons being taught, and it is WAY too easy to cheat. It's like there's always two sides of me fighting for the existence of online classes: 'No! If you don't listen to these lessons, you're going to get bad grades! Cheating is dishonorable!' and 'Yeah man it's so easy to cheat, no one will know, might as well right? We've got 'better' things to do anyways rather than waste our time on this, so go ahead and input a prompt on that chatbot already, yeah?' Now do you see exactly why it's so ineffective? The teachers are out here wasting their spit and time on us when we aren't even listening... There are WAY better options for virtual and non-face-to-face classes and lesson imparting, cause if we aren't going to listen to the online lessons, we might as well just stop having them, right?</p><p>Waste of time, resources, spit, and screentime. No one even participates in these online classes, 9/10 I'm pretty sure that no one virtually raises their hand on the online classes held in google meet. Either there's that one guy in your class tanking all the recitation points, or everybody gets called out randomly by the teacher. Also, most of the students in online classes don't even turn on their camera, which I'm pretty sure is ENFORCED and is RECOMMENDED when in an online class, or any other important meetings. So schools are lacking on that (enforcement). Honestly just send us modules that we'll (probably not) read thoroughly, along with the activities we have to do. It just seems like a better option than having our teachers waste half their day yapping while all the students are just either asleep, playing games, or are just not even present in the lesson, either virtually or physically.</p><p>IN CONCLUSION: Schools should just either ask google or chatgpt 'How to hold classes from throughout the country simultaneously except for online meetings'.</p>",
    "excerpt": "A deep dive into how online classes are a complete failure, from a student's perspective, due to distractions, cheating, and a lack of real engagement.",
    "authorId": "author6",
    "category": "Opinion",
    "tags": ["Online Class", "Rant", "Education"],
    "likes": ["author28", "author29", "author30"],
    "views": 5210,
    "comments": [
      {
        "id": "comment_1724640013000",
        "authorId": "author12",
        "content": "This is so relatable. I feel like I learned nothing from online classes.",
        "createdAt": "2024-07-28T09:00:00.000Z"
      },
      {
        "id": "comment_1724640014000",
        "authorId": "author12",
        "content": "My camera is ALWAYS off. It's a waste of time to turn it on when the teacher is just yapping.",
        "createdAt": "2024-07-28T09:05:00.000Z"
      }
    ],
    "createdAt": "2024-07-25T10:00:00.000Z",
    "updatedAt": "2024-07-25T10:00:00.000Z",
    "isSpotlight": true,
    "readTime": 7,
    "thumbnailUrl": "./thumbnails/blog-6-cover.jpg"
  },
  {
    "id": "7",
    "title": "The Truth About Why Students are Always Burnt Out",
    "content": "<h2>Why We're Drowning in Homework</h2><p>alright, the gajillion dollar question that the entire world always seems to ask but never has an answer too. Seriously? it isn't even that hard to connect the dots with how (especially our country's) schools have been operating, but less yapping and more saturated talking about why being burnt out is a literal canon event for us students. I'm pretty sure almost all students in the entire world know that homework was originally a punishment, right? by Roberto Nevilis in 1905 for... 'LAZY' students, crazy how fast time flies and how drastic things change right? cuz nowadays we get 99% homework, 1% lessons, we get NO breathing room bro, ZERO, NULL, NADA.</p><p>Groupings here groupings there projects here homework EVERYWHERE. Please, can we just chill for a moment and live out our youth and develop properly instead of always fixating and ruining ourselves along with our sleep schedules on these damned assignments? Honestly, they're getting way too old. It feels like everyday is just a new day and a new chance not to learn new things, master new skills, no... just another day for a fighting chance at trying to at least lessen your compiled work from school that seems to never stops piling. It isn't PVP nor PVE anymore it's PVS, Person Versus School, cause dang we cannot get a break, and don't get me started on the everyday stress and pressure we endure alongside these dreadful things, we have our own lives to live too, and the same goes along for our personal problems, all these groupings and whatnot, it actually starts getting at you, slowly but surely you'll fixate and spend too much time on these things that you sometimes neglect other things vital in your life, like your sleep, family bonding, gaming time, and generally having time to touch grass, and why? cause if we don't our future is COOKED DAWG, COOKED!</p><p>we are NOT no elon musk (im pretty sure that guy got his wealth from his parents anyways) that we can just chill here chill there financial freedom stress free life, no, we have to sweat, blood and tears, for these numbers 'we produce ourselves' for a decent future that we'll also probably struggle with. Like, right? why are you giving me so much work that I probably can't complete in the cramped deadline schedules they be giving us. Why is schoolwork so prevalent nowadays, it was originally all for friggin lazy students, what the heck did we do to deserve having to deal with all this, man.</p><p>IN CONCLUSION: stop making us waste so much time on school so much so that it affects important things in our lives, our grades are basically our future in this day and age, and unless you’re some freak of nature genius like bill gates or the guy who made amazon, you WILL and MUST have to work your way to get that degree and diploma, so you can have a proper 9/5 job to barely survive and manage a barely functioning family.</p><p>Anyways, Lillahm here, peace out.</p>",
    "excerpt": "A powerful critique on the overwhelming amount of homework and schoolwork that leaves students burnt out, kills their youth, and ultimately leads to a bleak future.",
    "authorId": "author6",
    "category": "Opinion",
    "tags": ["Mental Health", "Homework", "Rant", "Education"],
    "likes": ["author6", "author7", "author8", "author34", "author35"],
    "views": 9876,
    "comments": [
      {
        "id": "comment_1724640015000",
        "authorId": "author1",
        "content": "This is a masterpiece. Every point is painfully accurate. It's sad how much talent is wasted.",
        "createdAt": "2024-07-29T10:00:00.000Z"
      },
      {
        "id": "comment_1724640016000",
        "authorId": "author1",
        "content": "What about the good teachers? My science teacher is a lifesaver. You can't just generalize everyone.",
        "createdAt": "2024-07-29T10:05:00.000Z"
      }
    ],
    "createdAt": "2024-07-26T12:00:00.000Z",
    "updatedAt": "2024-07-26T12:00:00.000Z",
    "isSpotlight": true,
    "readTime": 15,
    "thumbnailUrl": "./thumbnails/blog-7-cover.jpg"
  },
  {
    "id": "8",
    "title": "Why Dropping Out Doesn’t Always Mean Failing in Life",
    "content": "<h2>Failure is a Choice, Not a Grade</h2><p>Time management? Did y’all teach us how to manage it? I ain’t gonna go freaking dance while coding, the heck is wrong with this subject? 13 years of Music Class and I don’t even know how to sing and play a single instrument. 'School is preparing you for the future', nigga shut up, this is not the freaking future. The only thing school taught me is how to make great excuses. STEM? Science, Technology, Engineering, and Mathematics? NAH, IT’S EVERYTHING BUT STEM—Stress, Tears, and Endless Modules. I hate school with passion. These are just some of the things I keep</p>",
    "excerpt": "A short but powerful rant on how schools fail to teach practical skills and instead become a source of 'Stress, Tears, and Endless Modules' for students.",
    "authorId": "author1",
    "category": "Opinion",
    "tags": ["Dropout", "Rant", "Education"],
    "likes": ["author2", "author1"],
    "views": 2541,
    "comments": [
      {
        "id": "comment_1724640017000",
        "authorId": "author16",
        "content": "YES! My STEM classes are more about theory than anything practical.",
        "createdAt": "2024-07-30T09:00:00.000Z"
      },
      {
        "id": "comment_1724640018000",
        "authorId": "author12",
        "content": "I feel this in my soul.",
        "createdAt": "2024-07-30T09:05:00.000Z",
        "isAnonymous": true
      }
    ],
    "createdAt": "2024-07-27T10:00:00.000Z",
    "updatedAt": "2024-07-27T10:00:00.000Z",
    "isSpotlight": true,
    "readTime": 3,
    "thumbnailUrl": "./thumbnails/blog-8-cover.jpg"
  },
  {
"id": "9",
"title": "How I Actually Learn Outside Class (Without Burning Out)",
"content": "<h2>Learning That Feels Human, Not Heavy</h2><p>I'm not against school. I'm against feeling like I'm always behind, even when I'm trying my best. Over time, I found a way to learn outside class that doesn't crush my energy or steal my weekends. It's simple on purpose. If you're tired, this is for you.</p><h3>The 3–2–1 Rule I Use Every Week</h3><p><strong>Three hours on one big skill</strong> (coding, writing, design—pick one), <strong>two hours on health</strong> (sleep, walks, stretching), and <strong>one hour on reflection</strong> (journaling and planning). That's it. Six hours total. If the week is rough, I cut it to 2–1–0.5. Progress still happens.</p><ul><li><strong>Big skill:</strong> I don’t watch 10 tutorials. I build one tiny project and ship it. A landing page. A simple calculator. A two-minute video.</li><li><strong>Health:</strong> If I sleep well, I understand faster. Boring truth. Worth it.</li><li><strong>Reflection:</strong> I write answers to three questions: What did I learn? What frustrated me? What’s my next tiny step?</li></ul><h3>My Mini-Project Template</h3><p>Projects make learning stick. Here’s the template I copy into a doc every time:</p><ol><li><em>Goal:</em> In one sentence (e.g., “Build a personal site with a contact form”).</li><li><em>Constraints:</em> Time limit (2 hours), tools (only what I already know), scope (MVP only).</li><li><em>Output:</em> A URL, a PDF, a GitHub repo—something visible.</li><li><em>Show:</em> Share with one person. Ask for one suggestion.</li></ol><h3>How I Study Fast When Time Is Tight</h3><ul><li><strong>15–5 cycles:</strong> Study 15 minutes, summarize for 5. No music with lyrics. Timer on.</li><li><strong>Notes I can search:</strong> I keep everything in one place. Short bullets. One page per topic.</li><li><strong>Test myself, not my memory:</strong> I try one practice problem before reading the lesson. It shows me what I don’t know yet.</li></ul><h3>When Motivation Drops</h3><p>I don't wait for motivation. I use <strong>friction</strong> and <strong>fuel</strong>:</p><ul><li><strong>Friction:</strong> Remove one barrier (close extra tabs, put phone in another room).</li><li><strong>Fuel:</strong> Add one reward (tea, music after, quick walk outside).</li></ul><h3>What Actually Changed for Me</h3><p>I stopped chasing “perfect” study days. I started finishing small things. My confidence grew because I had proof—projects, not just notes. The best part? I still have time to rest, play, and be a person.</p><h3>Try This This Week</h3><p>Pick one mini-project. Give it two hours. Limit your tools. Share the result with one friend. Then write three sentences about what you learned. That’s real progress.</p><p><em>Gentle reminder:</em> You don’t have to do everything. Just do the next kind thing for your future self.</p>",
"excerpt": "A calm, practical system for self-learning that uses tiny projects, reflection, and rest—so you grow without burning out.",
"authorId": "author1",
"category": "Guide",
"tags": ["Productivity", "Mental Health"],
"likes": ["author6", "author7", "author9", "author1"],
"views": 10342,
"comments": [
{
"id": "comment_1755964801000",
"authorId": "author6",
"content": "The 3–2–1 rule is so doable. Saving this.",
"createdAt": "2025-08-23T10:00:01.000Z"
},
{
"id": "comment_1755968401000",
"authorId": "author8",
"content": "Mini-project template = chef’s kiss. I actually finished one today.",
"createdAt": "2025-08-23T11:00:01.000Z",
"isAnonymous": true
}
],
"createdAt": "2025-08-23T08:30:00.000Z",
"updatedAt": "2025-08-23T08:30:00.000Z",
"isSpotlight": true,
"readTime": 11,
"thumbnailUrl": "./thumbnails/blog-9-cover.jpg"
},
{
"id": "10",
"title": "Dear Teachers: Five Small Changes That Help Students Thrive",
"content": "<h2>From a Student Who Wants to Learn Better</h2><p>To the teachers who care (and I know many of you do)—thank you. This is not a complaint. It’s a short list of gentle, practical changes that make a big difference for students like me.</p><h3>1) Post the “Why” at the top</h3><p>If you tell us in one sentence why a topic matters in real life, we focus better. Example: “We’re learning basic statistics so you can test claims online and not get fooled.” That one line changes everything.</p><h3>2) One rubric, many examples</h3><p>We don’t fear work—we fear guessing. A clear rubric plus two short examples (one basic, one strong) saves hours of confusion and panic.</p><h3>3) Deadlines with a grace window</h3><p>A 48-hour grace window, no questions asked, respects that life happens. Most of us won’t abuse it. We’ll just breathe and submit better work.</p><h3>4) More doing, less telling</h3><p>Ten minutes of hands-on practice beats thirty minutes of talking. A quick pair exercise, a mini-quiz, a discussion sprint—anything that makes us try.</p><h3>5) Feedback that points forward</h3><p>“Next time, focus on X” teaches more than a red X. We want to improve. Tell us where to aim.</p><h3>What Students Will Do Back</h3><ul><li>We’ll show up ready.</li><li>We’ll ask for help earlier.</li><li>We’ll own our mistakes and try again.</li></ul><p>We’re on the same side. We want to learn. Thank you for meeting us halfway.</p>",
"excerpt": "A respectful note to teachers: five small, realistic shifts—purpose, examples, grace, practice, and forward feedback—that transform the classroom.",
"authorId": "author1",
"category": "Opinion",
"tags": ["Education", "Teaching", "Student Voice"],
"likes": ["author7", "author10", "author12", "author1"],
"views": 8421,
"comments": [
{
"id": "comment_1755792002000",
"authorId": "author10",
"content": "As a teacher, I appreciate this. The grace window is a smart idea.",
"createdAt": "2025-08-21T10:00:02.000Z"
},
{
"id": "comment_1755795602000",
"authorId": "author9",
"content": "The 'why' line at the top helps my attention so much.",
"createdAt": "2025-08-21T11:00:02.000Z"
}
],
"createdAt": "2025-08-21T08:10:00.000Z",
"updatedAt": "2025-08-21T08:10:00.000Z",
"isSpotlight": true,
"readTime": 9,
"thumbnailUrl": "./thumbnails/blog-10-cover.jpg"
},
{
"id": "11",
"title": "A Simple Blueprint for Self-Study in Senior High",
"content": "<h2>Study Less, Understand More</h2><p>If you're overwhelmed, try a lighter framework that still works. You don’t need a fancy setup. You need a routine you can keep when life gets messy.</p><h3>The 4 Blocks</h3><ol><li><strong>Core (45 min):</strong> Today’s hardest topic. One source only. Write five bullet notes.</li><li><strong>Practice (30 min):</strong> One problem set or a tiny demo project. Show your work.</li><li><strong>Review (15 min):</strong> Summarize on one index card (or one note). No full sentences. Just cues.</li><li><strong>Share (5 min):</strong> Teach someone in one minute—out loud or in a voice note. If you can say it short, you get it.</li></ol><h3>Weekly Rhythm</h3><ul><li><strong>Mon–Thu:</strong> One 95-minute session per day is enough.</li><li><strong>Fri:</strong> Catch-up + tidy notes.</li><li><strong>Sat:</strong> One mini-project or mock test.</li><li><strong>Sun:</strong> Full rest. No guilt.</li></ul><h3>Project Ideas by Strand</h3><ul><li><em>STEM:</em> Build a unit converter, a basic physics visualizer, or a stats dashboard from a real dataset.</li><li><em>ABM:</em> Draft a one-page business plan and a simple cashflow table.</li><li><em>HUMSS:</em> Record a 3-minute explainer on a social issue with sources listed.</li><li><em>TVL/ICT:</em> Create a one-page portfolio and deploy it for free.</li></ul><h3>Tracking Progress Without Stress</h3><p>Each Sunday, answer: What did I finish? Where did I get stuck? What’s one small change for next week? Keep answers under six lines total. If it takes longer, you’re overthinking it.</p><h3>What to Let Go</h3><ul><li>Endless highlight colors.</li><li>Ten open textbooks.</li><li>Four productivity apps you barely use.</li></ul><p>Self-study works when it’s small, steady, and visible. Build the habit. The results will follow.</p>",
"excerpt": "Four short study blocks, a calm weekly rhythm, and small visible projects—self-study that fits real life.",
"authorId": "author1",
"category": "Guide",
"tags": ["Self-Study", "Senior High", "Routines"],
"likes": ["author6", "author8", "author11"],
"views": 9123,
"comments": [
{
"id": "comment_1755622803000",
"authorId": "author11",
"content": "95 minutes is manageable. The 'Share in 1 minute' tip is gold.",
"createdAt": "2025-08-19T10:00:03.000Z"
},
{
"id": "comment_1755626403000",
"authorId": "author7",
"content": "Tried the STEM mini-project idea. Finished one page and felt proud for once.",
"createdAt": "2025-08-19T11:00:03.000Z",
"isAnonymous": true
}
],
"createdAt": "2025-08-19T07:45:00.000Z",
"updatedAt": "2025-08-19T07:45:00.000Z",
"isSpotlight": true,
"readTime": 12,
"thumbnailUrl": "./thumbnails/blog-11-cover.jpg"
},
{
"id": "12",
"title": "What I Wish We Learned About Money Before Graduation",
"content": "<h2>Money Basics I Had to Teach Myself</h2><p>I'm not an expert—just a student who wanted fewer money surprises. These are the simple lessons I wish were in our curriculum, explained in plain words.</p><h3>1) Track first, judge later</h3><p>For two weeks, I wrote down every peso I spent. No budgets yet. Just awareness. It was eye-opening. After that, I set three limits: food, transport, and wants. I kept it flexible because life happens.</p><h3>2) Save for a cushion, not for Instagram</h3><p>A small emergency fund (even ₱1,000–₱3,000 to start) changes your stress levels. It’s not about being strict; it’s about being ready.</p><h3>3) Know your “fixed” vs “fun” money</h3><p>Fixed = the must-pays (load, fares, school stuff). Fun = guilt-free spending after fixed is covered. I put fun money in a separate e-wallet so I don’t touch the rest.</p><h3>4) Read payslips like a map</h3><p>If you work part-time or plan to soon, learn what deductions mean (tax, contributions). Understanding your take-home pay protects you from confusion and bad decisions.</p><h3>5) Build a tiny portfolio of proof</h3><p>Skills bring income. Keep your best three projects in one place with a one-line description of the value: “This landing page helped my tita’s shop get 40 inquiries.” That sentence is stronger than any grade.</p><h3>6) Money and mental health are linked</h3><p>When I plan my week, I plan my pesos too. I forgive myself for mistakes and keep going. Shame is expensive; learning is free.</p><p><em>Closing thought:</em> Start small, stay consistent, and be kind to your future self. Your money habits are part of your self-care.</p>",
"excerpt": "Practical money habits for students—tracking, cushions, payslips, and a portfolio mindset—explained gently and clearly.",
"authorId": "author1",
"category": "Guide",
"tags": ["Financial Literacy", "Wellbeing"],
"likes": ["author9", "author12", "author6", "author1"],
"views": 11054,
"comments": [
{
"id": "comment_1755449104000",
"authorId": "author12",
"content": "Separating fun money into a different wallet changed everything for me.",
"createdAt": "2025-08-17T16:45:04.000Z"
},
{
"id": "comment_1755452704000",
"authorId": "author8",
"content": "The 'proof sentence' for projects—so smart.",
"createdAt": "2025-08-17T17:45:04.000Z"
}
],
"createdAt": "2025-08-17T15:30:00.000Z",
"updatedAt": "2025-08-17T15:30:00.000Z",
"isSpotlight": true,
"readTime": 10,
"thumbnailUrl": "./thumbnails/blog-12-cover.jpg"
},
{
"id": "13",
"title": "Build a Portfolio While You’re Still in School (Yes, You Can)",
"content": "<h2>Grades Show Effort. Portfolios Show Value.</h2><p>Employers and clients want to see what you can do. You don’t need to be a genius. You need three clear projects that solve small, real problems.</p><h3>The 3–Project Starter Pack</h3><ol><li><strong>Help someone you know:</strong> Make a one-page site, a menu design, or a basic inventory sheet for a family business. Keep it simple and useful.</li><li><strong>Fix your own life:</strong> Build a study tracker, a personal budget sheet, or a habit log. If it helps you, it will impress others.</li><li><strong>Copy a pro, then credit:</strong> Recreate a public design or website layout for practice. State clearly: “Practice project inspired by X.” It shows taste and discipline.</li></ol><h3>How to Present It</h3><ul><li><strong>One sentence problem:</strong> “My classmate needed a clean menu for her home bakery.”</li><li><strong>What you did:</strong> “I designed a one-page menu and optimized it for printing.”</li><li><strong>Result:</strong> “She got 18 orders in the first week.”</li></ul><h3>Where to Host</h3><p>Use free tools. A simple Google Drive folder with tidy names works on day one. Later, move to a basic site or GitHub Pages. Don’t wait for perfect.</p><h3>Make It Findable</h3><ul><li>Put the link in your bio and resume.</li><li>Pin your best post on your socials.</li><li>Ask two friends for feedback and a one-line testimonial.</li></ul><h3>Keep It Current</h3><p>Update once a month. Remove old work you don’t love. Add one piece you’re proud of. Growth is the goal, not perfection.</p><p><em>Final nudge:</em> Start with what you have. Someone needs your simple solution today.</p>",
"excerpt": "A friendly roadmap to create a real portfolio now—three projects, clear storytelling, free hosting, and steady updates.",
"authorId": "author1",
"category": "Guide",
"tags": ["Portfolio", "Careers", "Projects"],
"likes": ["author7", "author8", "author10", "author11"],
"views": 9798,
"comments": [
{
"id": "comment_1755280805000",
"authorId": "author7",
"content": "Loved the 'fix your own life' idea. Makes it less scary.",
"createdAt": "2025-08-15T07:20:05.000Z"
},
{
"id": "comment_1755284405000",
"authorId": "author6",
"content": "The 3–project starter pack is exactly what I needed.",
"createdAt": "2025-08-15T08:20:05.000Z",
"isAnonymous": true
}
],
"createdAt": "2025-08-15T06:30:00.000Z",
"updatedAt": "2025-08-15T06:30:00.000Z",
"isSpotlight": true,
"readTime": 10,
"thumbnailUrl": "./thumbnails/blog-13-cover.jpg"
}
  
  
]